# Pandas

In [2]:
import pandas as pd

## Pandas Serisi Oluşturmak

In [5]:
pd.Series([88,22,12,63,74,75])   # sol tarafta index numaraları sağ tarafta ise veriler yer alır

0    88
1    22
2    12
3    63
4    74
5    75
dtype: int64

* Not : NumPy arrayden farklı olarak index numaralarını da veri tipinin içerisinde tutar.

In [6]:
seri=pd.Series([88,22,12,63,74,75])

In [7]:
seri.axes   # serinin index bilgilerine erişir

[RangeIndex(start=0, stop=6, step=1)]

In [8]:
seri.values  # seri içeriindeki verilere erişir

array([88, 22, 12, 63, 74, 75], dtype=int64)

In [9]:
seri.head(3)  # ilk 3 değeri getir anlamını taşır

0    88
1    22
2    12
dtype: int64

In [10]:
seri.tail(2)  # serinin son 2 verisine bakmak için

4    74
5    75
dtype: int64

## Index isimlendirmesi

In [11]:
pd.Series([5,7,9,8,56], index=[48,9,11,46,74])

48     5
9      7
11     9
46     8
74    56
dtype: int64

In [14]:
pd.Series([4,5,6,7,9], index=["da","b","c","p","y"])  # string ifadelerde yazılabilir

da    4
b     5
c     6
p     7
y     9
dtype: int64

In [15]:
seri=pd.Series([4,5,6,7,9], index=["da","b","c","p","y"])

In [16]:
seri["p"]

7

In [18]:
seri["da":"p"]

da    4
b     5
c     6
p     7
dtype: int64

In [19]:
sozluk=pd.Series({"reg":10, "log":11, "cart":12})
sozluk

reg     10
log     11
cart    12
dtype: int64

In [ ]:
# veya

In [21]:
sozluk2={"reg":10, "log":11, "cart":12}
seri=pd.Series(sozluk)
seri

reg     10
log     11
cart    12
dtype: int64

In [24]:
# iki serinin birleştirilmesi ile yeni bir seri oluşturulması
pd.concat([seri,seri])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

In [5]:
import numpy as np
a=np.array([1,7,46,3,23,78,87,36])
seri=pd.Series(a)
seri

0     1
1     7
2    46
3     3
4    23
5    78
6    87
7    36
dtype: int32

In [7]:
list(seri.items())

[(0, 1), (1, 7), (2, 46), (3, 3), (4, 23), (5, 78), (6, 87), (7, 36)]

In [12]:
seri.keys

<bound method Series.keys of 0     1
1     7
2    46
3     3
4    23
5    78
6    87
7    36
dtype: int32>

In [14]:
seri.values  # serinin sadece değerlerine erişir indexleri almaz

array([ 1,  7, 46,  3, 23, 78, 87, 36])

In [15]:
# eleman sorgulamak
7 in seri

True

In [17]:
seri[[2,4]]

2    46
4    23
dtype: int32

In [19]:
# eleman değiştirme işlemi
seri[5]=16
seri

0     1
1     7
2    46
3     3
4    23
5    16
6    87
7    36
dtype: int32

In [38]:
# index oluştururken;
seri1=pd.Series(["reg","log","cart","rf","km"],index=np.arange(4,9))
seri1

4     reg
5     log
6    cart
7      rf
8      km
dtype: object

In [36]:
seri2=pd.Series(["reg","log","cart","rf","km"])
seri2
#serinin indexini 1 den başlatmak istersek;
seri2.index+=1
seri2

1     reg
2     log
3    cart
4      rf
5      km
dtype: object

In [37]:
#serinin indexlerini 20 den 30 a ikişer ikişer arttırmak istersek
seri2.index=range(20,30,2)
seri2

20     reg
22     log
24    cart
26      rf
28      km
dtype: object

In [34]:
seri3=pd.Series(["a","b","c","d","e","h"],index=[i**2 for i in range(1,7)])
seri3

1     a
4     b
9     c
16    d
25    e
36    h
dtype: object

## DataFrame oluşturmak

In [41]:
# pd.DataFrame([değerler],columns="değişken isimleri")
m=np.arange(1,10).reshape(3,3)  # 3x3 lük array oluşturduldu
df=pd.DataFrame(m,columns=["var1","var2","var3"])
df

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [43]:
df.axes # satır ve sütn bilgilerini veriyor ( 0 dan başlayıp 3 e kadar gidiyor 1 er 1er artıyor)

[RangeIndex(start=0, stop=3, step=1),
 Index(['var1', 'var2', 'var3'], dtype='object')]

In [44]:
print(df.shape)  # df in elemanlarının boyut bilgisi
print(df.size)   # df nin eleman sayısı
print(df.ndim)   # df nin boyutu ( 2 ->> row and column)

(3, 3)
9
2

In [45]:
df.values  # df nin değerlerini  np array formuna dönüştürerek verir

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [47]:
# dict ile df  oluşturmak;

data={'Name':["a","b","c","d"],
     'Age':[2,4,7,9]}
df2=pd.DataFrame(data)
df2

  Name  Age
0    a    2
1    b    4
2    c    7
3    d    9

In [48]:
# list ile df oluşturmak

data=[["a",2],["b",4],["c",7],["d",9]]
df3=pd.DataFrame(data,columns=["Name","Age"])
df3

  Name  Age
0    a    2
1    b    4
2    c    7
3    d    9

In [58]:
data=[{"Name":"a","Age":2},
     {"Name":"b","Age":4},
     {"Age":7},
     {"Name":"d","Age":9}]
df4=pd.DataFrame(data,index=["val1","val2","val3","val4"])
df4

      Age Name
val1    2    a
val2    4    b
val3    7  NaN
val4    9    d

* Not : Eğer dict ile değerler verildiğinde hiç değer girilmemiş olanlaar NaN value olarak df oluşturulur

In [10]:
# birbirinden farklı iki listenin birbiri ile ilişkilendirilmesiyle df oluşturmak (zip kullanarak)
Name=["a","b","c","d"]
Age=[2,4,7,9]
df5=pd.DataFrame((list(zip(Name,Age))),columns=["Name","Age"])
df5

  Name  Age
0    a    2
1    b    4
2    c    7
3    d    9

* Not : Eğer list uzunları birbirinden farklı olsaydı en kısa olan listeye göre eleman sayılarını alacaktır

In [8]:
Name=["a","b","c","d"]
Age=[2,4,7]
df6=pd.DataFrame((list(zip(Name,Age))),columns=["Name","Age"])
df6

  Name  Age
0    a    2
1    b    4
2    c    7

In [5]:
#elemana erişmek için;
df6[1:2]

  Name  Age
1    b    4

## Silme İşlemi

In [9]:
# df.drop("silinmek istenen satırın indexi",axis= eğer satırdan almak isteniyorsa 0 sutundan almak isteniyorsa 1 yazılır
# inplace=True ise yapılan değişikliklerin kalıcı olmasını sağlar)
df6.drop(2,axis=0,inplace=True)  
df6

  Name  Age
0    a    2
1    b    4

In [12]:
# fancy index ile silme;
k=[1,3]
df5.drop(k,axis=0)

  Name  Age
0    a    2
2    c    7

## değişken sorgulamak;

In [13]:
m=["Name","School","Age"]
for i in m:
    print(i in df5)

True
False
True

In [24]:
# değişken oluşturmak için;
import numpy as np
d=np.arange(1,10).reshape(3,3)
df=pd.DataFrame(d,columns=["col1","col2","col3"])
df

   col1  col2  col3
0     1     2     3
1     4     5     6
2     7     8     9

In [25]:
df["col4"]=df["col1"]*df["col3"]
df

   col1  col2  col3  col4
0     1     2     3     3
1     4     5     6    24
2     7     8     9    63

In [27]:
# değişken silmek için;
df.drop("col2",axis=1,inplace=True)   # axis=1 olmasının sebebi columndan silmek istendiğinden
df

   col1  col3  col4
0     1     3     3
1     4     6    24
2     7     9    63

## Gözlem ve Değişken Seçimi ( loc , iloc)

In [4]:
data=np.random.randint(1,30,size=(10,3))
df=pd.DataFrame(data,columns=["var1","var2","var3"])
df

   var1  var2  var3
0     8    28    13
1     5    14     1
2    25     3    16
3    13    21    14
4    13    24    23
5    21     8    13
6    22    18    23
7     6     8     3
8     3     8    29
9    23    12    19

## Not:
* loc : verilen kurallara bağlı kalarak bir seçim yapılacaksa
* iloc : klasik indexleme ile seçim yapmak istenirse (-e kadar yani)   kullanılır. iloc da yanlızca integer değerler yazılabilir

In [32]:
df.loc[0:3]   # 3 ü de dahil eder

   var1  var2  var3
0    14    27    10
1     3     1     6
2    21    17    22
3    11    27    26

In [33]:
df.iloc[0:3] # 3 e kadar alır

   var1  var2  var3
0    14    27    10
1     3     1     6
2    21    17    22

In [36]:
df.loc[0:4,"var3"]

0    10
1     6
2    22
3    26
4    24
Name: var3, dtype: int32

In [38]:
df.iloc[0:4]["var3"]

0    10
1     6
2    22
3    26
Name: var3, dtype: int32

In [6]:
df["var1"]>5

0     True
1    False
2     True
3     True
4     True
5     True
6     True
7     True
8    False
9     True
Name: var1, dtype: bool

In [8]:
df.var3[0:4]

0    13
1     1
2    16
3    14
Name: var3, dtype: int32

## Koşullu ifadeler

In [12]:
df[df.var1>15][["var2","var3"]]

   var2  var3
2     3    16
5     8    13
6    18    23
9    12    19

In [14]:
df.loc[(df.var1>15),["var2","var3"]]  # loc kullımı ile

   var2  var3
2     3    16
5     8    13
6    18    23
9    12    19

In [15]:
df[(df.var1>15) & (df.var2<10)]

   var1  var2  var3
2    25     3    16
5    21     8    13

## Birleştirme İşlemleri

In [18]:
data2=np.arange(1,10).reshape(3,3)
df1=pd.DataFrame(data2,columns=["var1","var2","var3"])
df1

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [19]:
df2=df1+10      # yeni bir df oluşturuldu
df2

   var1  var2  var3
0    11    12    13
1    14    15    16
2    17    18    19

In [20]:
pd.concat([df1,df2])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9
0    11    12    13
1    14    15    16
2    17    18    19

* Not : indexlerde oluşan hatadan dolayı ignore_index=True parametresi yazılır ( default u false olarak gelir)

In [21]:
pd.concat([df1,df2], ignore_index=True)

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9
3    11    12    13
4    14    15    16
5    17    18    19

* Eğer columns isimleri aynı olmasaydı NaN values ile birleştirme yapacaktı ve bu uygun bir durum değildir.

In [22]:
df2.columns=["var1","var2","deg3"]
df2

   var1  var2  deg3
0    11    12    13
1    14    15    16
2    17    18    19

In [23]:
pd.concat([df1,df2], ignore_index=True)

C:\Users\TOSHIBA\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   deg3  var1  var2  var3
0   NaN     1     2   3.0
1   NaN     4     5   6.0
2   NaN     7     8   9.0
3  13.0    11    12   NaN
4  16.0    14    15   NaN
5  19.0    17    18   NaN

* Not : Bu durumu engellemek yani sadece aynı olan değişkenler ile birleştirmek için join="inner" ( inner:kesişimlere göre birleştir) parametresi kullanılır

In [27]:
pd.concat([df1,df2], ignore_index=True, join="inner")

   var1  var2
0     1     2
1     4     5
2     7     8
3    11    12
4    14    15
5    17    18

In [29]:
# eğer seçmiş olduğumuz dataframe göre birleştirmek istersek;
pd.concat([df1,df2], ignore_index=True, join_axes=[df2.columns]) # df2 in değişkenlerini tut df1 farklı olan değişkenlerini alma

   var1  var2  deg3
0     1     2   NaN
1     4     5   NaN
2     7     8   NaN
3    11    12  13.0
4    14    15  16.0
5    17    18  19.0

In [30]:
# birebir birleştirme işlemi;
df1=pd.DataFrame({"calisanlar":["ali","veli","ayse","fatma"],
                 "grup":["Muhasebe","Mühendislik","Mühendislik","Pazarlama"]})
df1

  calisanlar         grup
0        ali     Muhasebe
1       veli  Mühendislik
2       ayse  Mühendislik
3      fatma    Pazarlama

In [31]:
df2=pd.DataFrame({"calisanlar":["ali","veli","ayse","fatma"],
                 "giris_yili":[2010,2009,2014,2019]})
df2

  calisanlar  giris_yili
0        ali        2010
1       veli        2009
2       ayse        2014
3      fatma        2019

In [38]:
df3=pd.merge(df1,df2)# merge fonksiyonu birleştirmlerin hangi değişkene göre yapıldığını kendisi anlıyor(calışanlara göre yaptı)
df3

  calisanlar         grup  giris_yili
0        ali     Muhasebe        2010
1       veli  Mühendislik        2009
2       ayse  Mühendislik        2014
3      fatma    Pazarlama        2019

In [40]:
# çoktan teke birleştirme
df4=pd.DataFrame({"mudur":["caner","mustafa","berkcan"],
                 "grup":["Muhasebe","Mühendislik","Pazarlama"]})
df4

     mudur         grup
0    caner     Muhasebe
1  mustafa  Mühendislik
2  berkcan    Pazarlama

In [41]:
pd.merge(df3,df4)

  calisanlar         grup  giris_yili    mudur
0        ali     Muhasebe        2010    caner
1       veli  Mühendislik        2009  mustafa
2       ayse  Mühendislik        2014  mustafa
3      fatma    Pazarlama        2019  berkcan

In [2]:
import seaborn as sns

In [7]:
df=sns.load_dataset("planets")   # kütüphane içeirsinde bulunan hazır dataset yüklendi
df
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
method            1035 non-null object
number            1035 non-null int64
orbital_period    992 non-null float64
mass              513 non-null float64
distance          808 non-null float64
year              1035 non-null int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [8]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [10]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [11]:
df["mass"].mean()

2.6381605847953233

In [12]:
df["year"].count()

1035

In [13]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [14]:
df.dropna().describe()   # NaN değerleri almayarak hesaplama yapıyor

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

## Gruplama

In [30]:
df=pd.DataFrame({"ogrenciler":["A","B","C","A","B"],
                "ders1_puan":[10,11,52,23,43],
                "ders2_puan":[50,60,42,78,87]},columns=["ogrenciler","ders1_puan","ders2_puan"])
df

  ogrenciler  ders1_puan  ders2_puan
0          A          10          50
1          B          11          60
2          C          52          42
3          A          23          78
4          B          43          87

In [31]:
df.groupby("ogrenciler")  # ogrenciler değişkeninde herbirini grupluyor

* NOT : Gruplama işlemi sadece kategorik değişkenler için yapılır.

In [32]:
df.groupby("ogrenciler").mean()

            ders1_puan  ders2_puan
ogrenciler
A                 16.5        64.0
B                 27.0        73.5
C                 52.0        42.0

In [33]:
df.groupby("ogrenciler")["ders2_puan"].mean()   # ders2 puana göre ortalamaları

ogrenciler
A    64.0
B    73.5
C    42.0
Name: ders2_puan, dtype: float64

In [35]:
df.groupby("ogrenciler")["ders1_puan"].describe()

            count  mean        std   min    25%   50%    75%   max
ogrenciler
A             2.0  16.5   9.192388  10.0  13.25  16.5  19.75  23.0
B             2.0  27.0  22.627417  11.0  19.00  27.0  35.00  43.0
C             1.0  52.0        NaN  52.0  52.00  52.0  52.00  52.0

In [36]:
df.groupby("ogrenciler")["ders2_puan"].min()

ogrenciler
A    50
B    60
C    42
Name: ders2_puan, dtype: int64

In [38]:
df=pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
               "d1":[10,23,33,22,11,99],
               "d2":[100,253,333,262,111,969]},
               columns=["gruplar","d1","d2"])
df

  gruplar  d1   d2
0       A  10  100
1       B  23  253
2       C  33  333
3       A  22  262
4       B  11  111
5       C  99  969

In [ ]:
# aggregate() : birden fazla özelliğe göre değerlendirilmesi istenildiğinde kullanılır

In [46]:
df.groupby("gruplar").aggregate([max,np.median,min])

         d1              d2
        max median min  max median  min
gruplar
A        22     16  10  262    181  100
B        23     17  11  253    182  111
C        99     66  33  969    651  333

In [53]:
df.groupby("gruplar").aggregate({"d1":np.std,"d2":max})   # değişkenlere göre farklı işlemler de uygulanabilir

                d1   d2
gruplar
A         8.485281  262
B         8.485281  253
C        46.669048  969

In [55]:
# filter() : kendi oluşturduğumuz fonksiyonları df deki değişkenler üzerinde sorgulamak istersek kullanılır.

In [56]:
def filter_func(x):
    return x["d1"].std()>9

In [57]:
df.groupby("gruplar").filter(filter_func) # gruplama yap ve d1 değişkeninde standart sapması 9 dan büyük olanın verilerini getir

  gruplar  d1   d2
2       C  33  333
5       C  99  969

In [58]:
# transform() :  değişkenler üzerinde kendi oluşturduğumuz fonksiyonlar ile değişiklik yapmak istersek kullanılır.

In [59]:
#lambda: fonksiyon isimlendirilmesi yapmadan fonk oluşturmaya yarar

In [66]:
df_yeni=df.iloc[:,1:3]    # ketegorik değişkenler üzeirinde hesaplama yapılamacağından dolayı yeni df oluşturuldu
df_yeni

   d1   d2
0  10  100
1  23  253
2  33  333
3  22  262
4  11  111
5  99  969

In [70]:
df_yeni.transform(lambda x: (x-x.mean())/x.std()) 
# x e bağlı fonksiyon gezdiği herbir değişkenin gözlem değerinden değişkenin ortalamasından çıkar ve değişkenin(sütunun) standart sapmasına böl
# kısaca, herbir gözlem biriminden ortalamayı çıkarıp bulunan değerin standart sapmaya bölünmesi işlemidir

         d1        d2
0 -0.687871 -0.738461
1 -0.299074 -0.263736
2  0.000000 -0.015514
3 -0.328982 -0.235811
4 -0.657963 -0.704331
5  1.973890  1.957853

In [80]:
df.aggregate([np.mean,np.std])
# 0 indexi için d1 değişkeni; (10-33)/33 ->>> -0,68

             d1          d2
mean  33.000000  338.000000
std   33.436507  322.291793

In [76]:
(10-33)/33.436507

-0.687870895126695

In [81]:
# apply() : kendi oluşturduğumuz fonksiyonlar ile erişim sağlanır    df.apply(fonksiyon ismi)

In [95]:
def func2(x):
    return x.std()+2

In [97]:
df_yeni.apply(func2)

d1     35.436507
d2    324.291793
dtype: float64

## Pivot Table

In [3]:
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                         "bar", "bar", "bar", "bar"],
                   "B": ["one", "one", "one", "two", "two",
                         "one", "one", "two", "two"],
                   "C": ["small", "large", "large", "small",
                         "small", "large", "small", "small",
                         "large"],
                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                   "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
df

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

In [23]:
table = pd.pivot_table(df, values='D', index=['A', 'B'],
                    columns=['C'], aggfunc=np.sum, fill_value=0)   
## oluşturulan pivot tablodaki eksik değerleri fill_value parametresi ile doldurulabilir
table

C        large  small
A   B
bar one      4      5
    two      7      6
foo one      4      1
    two      0      6

In [16]:
table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
                    aggfunc={'D': np.mean,
                             'E': np.mean})
table

                  D         E
A   C
bar large  5.500000  7.500000
    small  5.500000  8.500000
foo large  2.000000  4.500000
    small  2.333333  4.333333

In [11]:
df

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

In [21]:
table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
                    aggfunc={'D': np.mean,
                             'E': [min, max, np.mean]})
table

                  D    E
               mean  max      mean  min
A   C
bar large  5.500000  9.0  7.500000  6.0
    small  5.500000  9.0  8.500000  8.0
foo large  2.000000  5.0  4.500000  4.0
    small  2.333333  6.0  4.333333  2.0

In [ ]:
* NOT : Eğer bir değişken kategorik değerli yapılmak istenirse; pd.cut() kullanılır

In [44]:
e=pd.cut(df["E"],[0,4,9])  # [istenilen aralıklar yazılır]
e

0    (0, 4]
1    (0, 4]
2    (4, 9]
3    (4, 9]
4    (4, 9]
5    (4, 9]
6    (4, 9]
7    (4, 9]
8    (4, 9]
Name: E, dtype: category
Categories (2, interval[int64]): [(0, 4] < (4, 9]]

In [42]:
df.pivot_table(values="D",index=["C",e],aggfunc=np.mean)

                     D
C     E
large (0, 4]  2.000000
      (4, 9]  4.333333
small (0, 4]  1.000000
      (4, 9]  4.250000